In [3]:
import pandas as pd

In [4]:
df_titanic = pd.read_csv('Titanic-Dataset.csv')

In [5]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df_titanic['Survived'].sum()

342

### Seleccion de sub conjunto de datos por columnas

In [9]:
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:

list_1 = ['Name','Sex','Age','Survived']

df_1 = df_titanic[list_1]

In [11]:
df_1.head()

                                                Name     Sex   Age  Survived
0                            Braund, Mr. Owen Harris    male  22.0         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0         1
2                             Heikkinen, Miss. Laina  female  26.0         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0         1
4                           Allen, Mr. William Henry    male  35.0         0

In [12]:
df_1.shape

(891, 4)

### Seleccion de sub conjunto de datos por filas

In [13]:
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
# Pasajeros mayores a 30 años
df_30 = df_titanic[df_titanic['Age'] > 30]

In [15]:
df_30.shape

(305, 12)

In [16]:
df_30.info()

<class 'pandas.core.frame.DataFrame'>
Index: 305 entries, 1 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  305 non-null    int64
 1   Survived     305 non-null    int64
 2   Pclass       305 non-null    int64
 3   Name         305 non-null    object
 4   Sex          305 non-null    object
 5   Age          305 non-null    float64
 6   SibSp        305 non-null    int64
 7   Parch        305 non-null    int64
 8   Ticket       305 non-null    object
 9   Fare         305 non-null    float64
 10  Cabin        116 non-null    object
 11  Embarked     303 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 31.0+ KB

In [17]:
# pasajeros en las clases 2 y 3

# df_titanic['Pclass'].unique()

In [18]:
# Pasajeros pertenecientes a las clases 2 y 3 del titanic

df_class23 = df_titanic[df_titanic['Pclass'].isin([2,3])]

In [19]:
df_class23.shape

(675, 12)

In [20]:
# Pasajeros pertenecientes a la clase 3

df_class3 = df_titanic[df_titanic['Pclass'].isin([3])]

In [21]:
# Porcentaje de pasajeros en 3ra clase

df_class3.shape[0] / df_titanic.shape[0] * 100

55.106621773288445

In [22]:
# Pasajeros pertenecientes a las clases 2 y 3 con el operador or " | "

df_c23 = df_titanic[ (df_titanic['Pclass'] == 2) | (df_titanic['Pclass'] == 3) ]

In [23]:
df_c23.info()

<class 'pandas.core.frame.DataFrame'>
Index: 675 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  675 non-null    int64
 1   Survived     675 non-null    int64
 2   Pclass       675 non-null    int64
 3   Name         675 non-null    object
 4   Sex          675 non-null    object
 5   Age          528 non-null    float64
 6   SibSp        675 non-null    int64
 7   Parch        675 non-null    int64
 8   Ticket       675 non-null    object
 9   Fare         675 non-null    float64
 10  Cabin        28 non-null     object
 11  Embarked     675 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 68.6+ KB

In [24]:
# Pasajeros de las clase 2 y 3 con edad valida
# .notna() = muestra filas con valores validos
df_c23_age = df_c23[ df_c23['Age'].notna() ]

In [25]:
# .isna() = muestra los valores nulos
df_c23_age[df_c23_age['Age'].isna()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [36]:
# filtros de filas y columnas
# .loc = filtra por filas y columnas

df_titanic.loc[df_titanic['Age'] > 30, ["Name", "Sex"]]

                                                  Name     Sex
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
6                              McCarthy, Mr. Timothy J    male
11                            Bonnell, Miss. Elizabeth  female
..                                                 ...     ...
873                        Vander Cruyssen, Mr. Victor    male
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female
881                                 Markun, Mr. Johann    male
885               Rice, Mrs. William (Margaret Norton)  female
890                                Dooley, Mr. Patrick    male

[305 rows x 2 columns]

In [46]:
# filtros por indices
# En este ejemplo se muestran 5 filas a partir de la fila 0 y solo se toman las columnas 0, 1, 2 y 3 (inclusive)

df_titanic.iloc[:5, :4]

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,"Allen, Mr. William Henry"